Section1

# Gitって何のために使うの？
- ファイルのバージョンを管理する

## Gitが無くてファイルのバージョンが管理をしていないと、、、
- 最新のファイルがわからなくなる
- 複数人でファイルを編集する際に、誰かが編集していたファイルを上書きしてしまう

## ファイルのバージョンを管理すれば、、、
- ファイルの最新の状態がわかる
- いつ、誰が、何を変更したのかわかる
- 以前の状態にも戻せる
- 誰かが、編集したものを気づかずに上書きしようとすると、警告を出せるようにできる


# Githubとは
- コードのホスティングサービス
- 分かりやすく言うと、Gitが管理しているファイルの変更履歴をオンライン上で扱えるようにするサービス

# Githubの特徴

## プルリクエストによる複数人開発
- GithubにあるGitリポジトリ,コードに対して自分が変更したコードを取り込んでもらえるようにリクエストする
- バグを修正したので取り込んでもらえないか , 機能を追加したので取り込んでもらえないかといった変更の取り組みをリクエストする
- プルリクエストを元に、コメントのやりとりもできる。
- 「ありがとう!」と言って、取り込んだり , 「これらは、取り込めないよ」と却下したり , 「もっとこういう風にして」と修正依頼を出せる
- コードのレビューがしやすく, チームで開発しやすくなった。

## 世界中のチームがGithub上で開発 
- チームのソフトウェアが見える, 世界がどんな開発をしているのか見える , 更に、そこに参加できる






