Genba_Rails/taskleaf/app/controllers/tasks_controller.rb

SELECT COUNT(DISTINCT "tasks"."id") FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 2]]
SELECT DISTINCT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 2]]
---
  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page]).per(50)

UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "fアファメーショ"], ["updated_at", "2022-08-16 11:18:53.014648"], ["id", 6]]
---
  def update

    @task.update(task_params)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "fアファーマティブ"], ["description", ""], ["created_at", "2022-09-12 07:04:57.364662"], ["updated_at", "2022-09-12 07:04:57.364662"], ["user_id", 2]]
---
  def create
    @task = current_user.tasks.new(task_params)

    if params[:back].present?
      render :new
      return
    end

    if @task.save!