Genba_Rails/taskleaf/app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @task = current_user.tasks.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task = current_user.tasks.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    task = current_user.tasks.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    task = current_user.tasks.find(params[:id])