Genba_Rails/taskleaf/app/models/task.rb

            task = new
            task.attributes = row.to_hash.slice(*csv_attributes)
            task.save!
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "餃子を作る"], ["description", "160個作ります"], ["created_at", "2022-09-12 01:18:11.622700"], ["updated_at", "2022-09-12 01:18:11.622700"], ["user_id", 2]]